sunrise-designs/OpenPolysom/ESP32-C6-heart-idf/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y

# Flash size — chip is ESP32-C6FH4 (4MB embedded flash, per the board schematic)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FATFS / SD
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Serial console / monitor baud rate — also the rate tools/set_time.py uses
# to send the binary time-sync command (see components/time_sync).
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
